IDENTIFICATION DIVISION.
   PROGRAM-ID. TABUADA.

ENVIRONMENT DIVISION.

DATA DIVISION.
    WORKING-STORAGE SECTION.

    01 CONTADOR PIC 99.
    01 NUM      PIC 9(2).
    01 RESULT   PIC 9(3).

PROCEDURE DIVISION.
    MAIN-PROCEDURE.

        DISPLAY "Digite um numero: "
        ACCEPT NUM

        PERFORM VARYING CONTADOR FROM 0 BY 1
            UNTIL CONTADOR > 10
            MULTIPLY NUM BY CONTADOR GIVING RESULT
            DISPLAY NUM " X " CONTADOR " = " RESULT
        END-PERFORM

    STOP RUN.